app/controllers/comments_controller.rb

  def index
    @comments = @current_user.comments.all
---
SELECT * FROM `comments` WHERE (`comments`.commentable_id = 1 AND `comments`.commentable_type = 'User')

  def show
    @comment = @current_user.comments.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 2 AND (`comments`.commentable_id = 1 AND `comments`.commentable_type = 'User'))

  def create
    @comment = @current_user.comments.build(params[:comment])
    @comment.user = @current_user
    if @comment.save
---
INSERT INTO `comments` (`created_at`, `commentable_type`, `commentable_id`, `updated_at`, `text`, `approved`, `user_id`) VALUES('2010-10-22 16:26:38', NULL, NULL, '2010-10-22 16:26:38', 'Comentário foda sobre esse cavalo :)', NULL, NULL)