app/controllers/documents_controller.rb

  def show
    @document = @user.documents.find(params[:id])
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1 AND (`documents`.user_id = 1))

  def create
    @document = @user.documents.build(params[:document])
    if @document.save
---
INSERT INTO `documents` (`name`, `created_at`, `file_content_type`, `file_file_size`, `updated_at`, `file_file_name`, `file_updated_at`, `user_id`) VALUES('Meu documento do caralho', '2010-10-22 16:36:01', NULL, NULL, '2010-10-22 16:36:01', NULL, NULL, 1)

  def edit
    @document = @user.documents.find(params[:id])
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1 AND (`documents`.user_id = 1))

  def update
    @document = @user.documents.find(params[:id])
    if @document.update_attributes(params[:document])
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1 AND (`documents`.user_id = 1))
UPDATE `documents` SET `updated_at` = '2010-10-22 16:39:49', `name` = 'Eu fazendo update do documento :)' WHERE `id` = 1

  def find_user
    params[:user_id] ? @user = User.find(params[:user_id]) : @user = @current_user
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1