app/controllers/events_controller.rb

SELECT * FROM `events` WHERE (`events`.user_id = 1)
---
  def index
    @events = @current_user.events.all

SELECT * FROM `events` WHERE (`events`.`id` = 1 AND (`events`.user_id = 1))
---
  def show
    @event = @current_user.events.find(params[:id])

INSERT INTO `events` (`name`, `location`, `end_time`, `latitude`, `created_at`, `updated_at`, `user_id`, `description`, `longitude`, `start_time`) VALUES('Evento do caralho em Anápolis', 'Aqui mesmo :)', '2013-12-17 18:18:00', NULL, '2010-10-22 16:50:59', '2010-10-22 16:50:59', 1, 'Um evento mto louco, mano!', NULL, '2015-12-19 18:18:00')
---
  def create
    @event = @current_user.events.new(params[:event])
    if @event.save

SELECT * FROM `events` WHERE (`events`.`id` = 1 AND (`events`.user_id = 1))
---
  def edit
    @event = @current_user.events.find(params[:id])

SELECT * FROM `events` WHERE (`events`.`id` = 1 AND (`events`.user_id = 1))
DELETE FROM `events` WHERE `id` = 1
---
  def destroy
    @event = @current_user.events.find(params[:id])
    @event.destroy

SELECT * FROM `events` WHERE (`events`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def join
    @event = Event.find(params[:id])
    user = User.find(params[:user_id])