app/controllers/groups_controller.rb

SELECT * FROM `groups` WHERE (`groups`.user_id = 1)
---
  def index
    @groups = @owner ? @owner.groups.all : Group.all

SELECT * FROM `groups` WHERE (`groups`.`id` = 1 AND (`groups`.user_id = 1))
---
  def show
    @group = Group.find(params[:id])

INSERT INTO `groups` (`name`, `created_at`, `updated_at`, `user_id`, `description`) VALUES('Meu novo grupo', '2010-10-22 16:58:18', '2010-10-22 16:58:18', 1, 'Descrição do meu grupo do caralho')
---
  def create
    @group = @current_user.groups.new(params[:group])
    if @group.save

SELECT * FROM `groups` WHERE (`groups`.`id` = 1 AND (`groups`.user_id = 1))
---
  def edit
    @group = @current_user.groups.find(params[:id])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1 AND (`groups`.user_id = 1))
DELETE FROM `groups` WHERE `id` = 1
---
  def destroy
    @group = @current_user.groups.find(params[:id])
    @group.destroy

SELECT * FROM `groups` WHERE (`groups`.`id` = 2)
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def join
    @group = Group.find(params[:id])
    user = User.find(params[:user_id])