app/controllers/images_controller.rb

SELECT * FROM `images` WHERE (`images`.user_id = 1)
---
  def index
    @images = @owner.images.all

SELECT * FROM `images` WHERE (`images`.`id` = 1 AND (`images`.user_id = 1))
---
  def show
    @image = @owner.images.find(params[:id])

INSERT INTO `images` (`name`, `author`, `user_id`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `created_at`, `updated_at`) VALUES('Testing images', 'Tiago Paulino', 1, 'image001.jpg', 'image/jpeg', 6273, '2010-11-04 14:39:35', '2010-11-04 14:39:35', '2010-11-04 14:39:35')
---
  def create
    @image = @current_user.images.build(params[:image])
    if @image.save

SELECT * FROM `images` WHERE (`images`.`id` = 1 AND (`images`.user_id = 1))
---
  def edit
    @image = @current_user.images.find(params[:id])

SELECT * FROM `images` WHERE (`images`.`id` = 1 AND (`images`.user_id = 1))
DELETE FROM `images` WHERE `id` = 1
---
  def destroy
    @image = @current_user.images.find(params[:id])
    @image.destroy