app/controllers/musics_controller.rb

  def index
    @musics = @owner ? @owner.musics.all : Music.all
---
SELECT * FROM `musics` WHERE (`musics`.user_id = 2)

  def show
    @music = Music.find(params[:id])
---
SELECT * FROM `musics` WHERE (`musics`.`id` = 3 AND (`musics`.user_id = 2))

  def create
    @music = @current_user.musics.build(params[:music])
    if @music.save
---
INSERT INTO `musics` (`name`, `author`, `user_id`, `music_file_name`, `music_content_type`, `music_file_size`, `music_updated_at`, `created_at`, `updated_at`) VALUES('Audioslave - Like a Stone', 'Audioslave', 1, 'Like a Stone.mp3', 'audio/mp3', 7064859, '2010-11-04 15:07:44', '2010-11-04 15:07:44', '2010-11-04 15:07:44')

  def edit
    @music = Music.find(params[:id])
---
SELECT * FROM `musics` WHERE (`musics`.`id` = 5 AND (`musics`.user_id = 1))

  def destroy
    @music = @current_user.musics.find(params[:id])
    @music.destroy
---
SELECT * FROM `musics` WHERE (`musics`.`id` = 2 AND (`musics`.user_id = 2))
DELETE FROM `musics` WHERE `id` = 2