app/controllers/users_controller.rb

  def show
    @user = params[:id] ? User.find(params[:id]) : current_user
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`name`, `avatar_file_name`, `avatar_file_size`, `created_at`, `crypted_password`, `updated_at`, `avatar_content_type`, `persistence_token`, `description`, `hometown`, `login`, `email`, `active`) VALUES('Tiago Paulino', NULL, NULL, '2010-10-22 16:17:33', '801869939bc17c490aee1822b8b29f0040f29439b2c1121f7e98d08cc2596d59868621a0b6a719acc6cdc0aa637e765ef3ad683b5f84f4ef5ae15d85263a94b2', '2010-10-22 16:17:33', NULL, 'ba0d91aef90ebbff3796e8cfd780b506bc460dc9d9d830a05a156360a03f535a3dc3f22259292f3808e809b77a4c5288abdcb6956899dd0409a1dbe9b511209d', '', 'Sobradinho, DF, Brazil', 'danadao', 'danadao@gmail.com', 1)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
UPDATE `users` SET `updated_at` = '2010-10-22 20:24:11', `avatar_file_size` = 48466, `avatar_file_name` = 'Photo on 2010-08-22 at 22.25 #3.jpg', `avatar_content_type` = 'image/jpeg' WHERE `id` = 1