app/controllers/videos_controller.rb

  def index
    @videos = @current_user.videos.all
---
SELECT * FROM `videos` WHERE (`videos`.user_id = 1)

  def show
    @video = @current_user.videos.find(params[:id])
---
SELECT * FROM `videos` WHERE (`videos`.`id` = 1 AND (`videos`.user_id = 1))

  def create
    @video = @current_user.videos.build(params[:video])
    if @video.save
---
INSERT INTO `videos` (`name`, `created_at`, `author`, `updated_at`, `video_content_type`, `video_file_size`, `video_updated_at`, `user_id`, `video_file_name`) VALUES('Testing', '2010-10-22 20:20:54', 'Eu', '2010-10-22 20:20:54', NULL, NULL, NULL, 1, NULL)

  def edit
    @video = @current_user.videos.find(params[:id])
---
SELECT * FROM `videos` WHERE (`videos`.`id` = 1 AND (`videos`.user_id = 1))

  def update
    @video = @current_user.videos.find(params[:id])
    if @video.update_attributes(params[:video])
---
SELECT * FROM `videos` WHERE (`videos`.`id` = 1 AND (`videos`.user_id = 1))
UPDATE `videos` SET `video_file_name` = 'SDC11011.JPG', `updated_at` = '2010-10-22 20:22:49', `video_file_size` = 1465045, `video_updated_at` = '2010-10-22 20:22:49', `video_content_type` = 'image/jpeg' WHERE `id` = 1